# -*- coding: utf-8 -*-

import itertools

LIST_OF_ADMINS = [449915551, 488295339]

MONTH_MAPPING = {
    '01': 'Січня',
    '02': 'Лютого',
    '03': 'Березня',
    '04': 'Квітня',
    '05': 'Травня',
    '06': 'Червня',
    '07': 'Липня',
    '08': 'Серпня',
    '09': 'Вересня',
    '10': 'Жовтня',
    '11': 'Листопада',
    '12': 'Грудня',
}
MONTH_MAPPING_INFINITIVE = {
    '01': 'січень',
    '02': 'лютий',
    '03': 'березень',
    '04': 'квітень',
    '05': 'травень',
    '06': 'червень',
    '07': 'липень',
    '08': 'серпень',
    '09': 'вересень',
    '10': 'жовтень',
    '11': 'листопад',
    '12': 'грудень',
}

DELIMITER = '/'

SOURCES = {
    'SITE': "https://clk.tradedoubler.com/click?p=232108&a=2937217&g=21113908&url=http://",
    'TG': "https://clk.tradedoubler.com/click?p=232108&a=3068494&g=21113908&url=http://",
    'FB': "https://clk.tradedoubler.com/click?p=232108&a=3068495&g=21113908&url=http://",
}

EMODJI = itertools.cycle('🔸🔹')
